{
  "adaptive_patching_levels": 0,
  "architectures": [
    "TinyTimeMixerForPrediction"
  ],
  "categorical_vocab_size_list": null,
  "context_length": 90,
  "d_model": 63,
  "d_model_scale": 7,
  "decoder_adaptive_patching_levels": 0,
  "decoder_d_model": 18,
  "decoder_d_model_scale": 2,
  "decoder_mode": "common_channel",
  "decoder_num_layers": 4,
  "decoder_raw_residual": false,
  "distribution_output": "student_t",
  "dropout": 0.4,
  "enable_forecast_channel_mixing": false,
  "exogenous_channel_indices": null,
  "expansion_factor": 2,
  "fcm_context_length": 1,
  "fcm_gated_attn": true,
  "fcm_mix_layers": 3,
  "fcm_prepend_past": true,
  "fcm_prepend_past_offset": null,
  "fcm_use_mixer": true,
  "frequency_token_vocab_size": 10,
  "gated_attn": true,
  "head_dropout": 0.4,
  "init_embed": "pytorch",
  "init_linear": "pytorch",
  "init_processing": true,
  "init_std": 0.02,
  "loss": "mae",
  "mask_value": 0,
  "masked_context_length": null,
  "mode": "common_channel",
  "model_type": "tinytimemixer",
  "norm_eps": 1e-05,
  "norm_mlp": "LayerNorm",
  "num_input_channels": 1,
  "num_layers": 20,
  "num_parallel_samples": 100,
  "num_patches": 11,
  "patch_last": true,
  "patch_length": 9,
  "patch_stride": 9,
  "positional_encoding_type": "sincos",
  "post_init": false,
  "prediction_channel_indices": null,
  "prediction_filter_length": null,
  "prediction_length": 30,
  "resolution_prefix_tuning": true,
  "scaling": "std",
  "self_attn": false,
  "self_attn_heads": 1,
  "stride_ratio": 1,
  "torch_dtype": "float32",
  "transformers_version": "4.38.0",
  "use_decoder": true,
  "use_positional_encoding": false
}
